mytube/app/controllers/videos_controller.rb

INSERT INTO "videos" ("title", "embed_link", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"
---
  def create
    @video = Video.new(video_params)

    respond_to do |format|
      if @video.save

SELECT "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_video
      @video = Video.find(params[:id])